int/resources/objectRepo/xmlTemplates/htng/HTNG2008BActivity/req_ActivityLookup.xml

<soapenv:Envelope xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://htng.org/PWS/2008B/SingleGuestItinerary/Activity/Types" xmlns:typ1="http://htng.org/PWS/2008B/SingleGuestItinerary/Common/Types">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:ActivityLookupRequest>
         <typ:ActivityLookup externalSystemId="?">
            <typ:ProfileID>
               <typ1:UniqueID source="?"/>
            </typ:ProfileID>
            <typ:PersonName familiarName="?" nameOrdered="?">
               <typ1:NameTitle/>
               <typ1:FirstName/>
               <typ1:MiddleName/>
               <typ1:LastName/>
               <typ1:NameSuffix/>
            </typ:PersonName>
            <typ:Address addressType="?" otherAddressType="?">
               <typ1:AddressLine/>
               <typ1:CityName/>
               <typ1:StateProv/>
               <typ1:CountryCode/>
               <typ1:PostalCode/>
            </typ:Address>
            <typ:Phone phoneRole="?" phoneType="?">
               <typ1:PhoneNumber/>
               <typ1:PhoneData>
                  <typ1:CountryAccessCode/>
                  <typ1:AreaCode/>
                  <typ1:PhoneNumber/>
                  <typ1:Extension/>
               </typ1:PhoneData>
            </typ:Phone>
            <typ:TimeSpan>
               <typ1:Start/>
               <typ1:End/>
            </typ:TimeSpan>
            <typ:Activities>
               <typ:Activity status="?">
                  <typ:ActivityIDs>
                     <typ1:UniqueID source="?"/>
                  </typ:ActivityIDs>
                  <typ:ActivityType/>
                  <typ:Location/>
                  <typ:Name language="?"/>
                  <typ:NumberOfPersons/>
                  <typ:TimeSpan>
                     <typ1:Start/>
                     <typ1:End/>
                  </typ:TimeSpan>
                  <typ:Duration>
                     <typ1:Start/>
                     <typ1:End/>
                  </typ:Duration>
                  <typ:Description language="?"/>
                  <typ:Note language="?"/>
                  <typ:GroupCode/>
                  <typ:Amount currencyCode="?"/>
                  <typ:DepositRequired collectedBy="?" currencyCode="?"/>
                  <typ:InactiveDate/>
                  <typ:Participants>
                     <typ:Participant familiarName="?" nameOrdered="?">
                        <typ1:NameTitle/>
                        <typ1:FirstName/>
                        <typ1:MiddleName/>
                        <typ1:LastName/>
                        <typ1:NameSuffix/>
                     </typ:Participant>
                  </typ:Participants>
                  <typ:URLLink/>
                  <typ:Extensions>
                     <typ:ActivitySpecific/>
                  </typ:Extensions>
               </typ:Activity>
            </typ:Activities>
            <typ:Membership>
               <typ1:MembershipType/>
               <typ1:MembershipNumber/>
               <typ1:MembershipLevel/>
               <typ1:MemberName/>
               <typ1:EffectiveDate/>
               <typ1:ExpirationDate/>
               <typ1:CurrentPoints/>
            </typ:Membership>
            <typ:ResortId/>
         </typ:ActivityLookup>
      </typ:ActivityLookupRequest>
   </soapenv:Body>
</soapenv:Envelope>